{"Chinese 3 Honors": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "9-12", "description": "Chinese 3 Honors is designed for students who passed Chinese 1 and 2 and thus possess a basic knowledge of Mandarin. Students continue to expand their listening and speaking abilities by applying them to more complex scenarios. They develop their reading and writing skills on academic and complex texts. Chinese 3 Honors shares similar course objectives and introduces similar topics as Chinese 3 but does so in an accelerated pacing and spends more time exploring topics in depth. It is a preparation course for AP Chinese. At the end of the year, students are able to produce and present their own viewpoints of events by using the Chinese language in both spoken and written forms. Typing in Chinese is another skill refined in this course. The instructional language is in Mandarin Chinese.continued...", "notes_prerequisites": "Permission from Chinese 2 teacher required"}, "Critical Thinking and Social Change ": {"length": "Yearlong", "A-G": "G-Elective", "grades": "10-12", "description": "CTSC is a leadership course based on the knowledge that youth have often been at the center of powerful social movements & are always powerful resources for their peers. Using an equity lens, we will examine historical & current social justice issues within our school, city & country. From this foundation, students create support programs & positive change within Lowell.  CTSC also offers an opportunity for reflection on personal and collective identity.Through the interdisciplinary study of literature, history, and sociology, students learn to critically analyze multiple texts in order to reflect on personal and collective identity for community impact. Using literary texts, historical case-studies, and theoretical frameworks, students closely examine their construction of identity alongside the construction of institutions. As such they develop the knowledge and skills to address the inequities in their schools and communities.", "notes_prerequisites": ""}, "Dance 2 (full year)": {"length": "Yearlong", "A-G": "F-VPA", "grades": "10-12", "description": "In Dance 2, students learn intermediate skills of dance while improving their techniques, poise, self confidence, and creative ability. Students continue to refine proper body alignments, body part articulation, muscle strength and flexibility, and coordination in axial and locomotor movement. They demonstrate an intermediate level of consistency and reliability in performing technical skills to create dances with coherence and aesthetic unity. Students examine ways that dance creates and conveys meaning and establish aesthetic criteria in evaluating their own work and that of others. They will perform and discuss movement, motifs, phrases, and dance compositions with particular attention to how meaning was created.continued...", "notes_prerequisites": ""}, "Japanese 1": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "9-11", "description": "Japanese 1 is a first-year language course that introduces students to the Japanese language and culture. Learners develop their speaking, reading, writing, and listening skills. This course stresses the use of interpersonal, interpretive, and presentational activities to introduce novice-low level Japanese vocabulary and grammar. Students also become familiar with Japanese values and customs to foster culturally sensitive communication and awareness of cultural differences. Learners work cooperatively to become able to greet others, ask/answer questions, and describe a variety of topics in regards to themselves and other individuals. The three Japanese writing systems - hiragana, katakana, kanji - are all covered.continued...", "notes_prerequisites": ""}, "English 2A: Adolescent in Literature (offered fall and spring)  &English 2B: Points of View (offered fall and spring)": {"length": "Semester", "A-G": "B-English", "grades": "10", "description": "In this course, students critically analyze various themes within the ethnic experience in American literature by comparing them to universal themes. The course focuses on developing the literacy skills of reading, writing, listening, and speaking through analysis of literary and expository texts (e.g., novels, short stories, plays, works of nonfiction, poetry, digital media) focused on issues related to identity, race, ethnicity, culture, and humanization. Through the writing process, students produce a variety of essays structured around a clearly presented and soundly supported thesis. Summative learning experiences may include essays taken through the writing process, debates, and oral presentations using multiple technology tools.", "notes_prerequisites": "Somophores must select both English 2A and 2B to complete a full year"}, "Latin 2": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "9-12", "description": "Latin 2 continues the study of the Latin language and the classical culture. Students learn vocabulary, grammar, syntax, and culture through stories. They study Latin words and compare them with English words derived from Latin roots. Key concepts covered are noun-adjective agreement, noun-adjective declensions, pronoun use, passive voices, participles, and relative clauses. Reading, translating, listening and writing are part of students' daily practice in order to develop vocabulary and understanding of the grammar and syntax. Students learn about the Classical culture through culturally related stories that are adapted, or modified.", "notes_prerequisites": ""}, "AP Art Drawing": {"length": "Yearlong", "A-G": "F-VPA", "grades": "10-12", "description": "The AP Studio Art Program consists of three portfolio exams—2-D Design, 3-D Design, and Drawing—corresponding to the college foundation courses. Portfolios allow flexibility of coursework while guiding students to produce college-level quality, artistic investigation, and breadth of work. The Drawing portfolio addresses issues such as line quality, light and shade, rendering of form, composition, surface manipulation, the illusion of depth, and mark-making. Students' portfolios demonstrate skills and ideas developed, refined, and applied throughout the course to produce visual compositions. Students may choose to submit any or all of the portfolios. Portfolios are evaluated based on standardized scoring descriptors aligned with skills and understanding developed in college foundation courses.", "notes_prerequisites": "Completion of VPA requirement & 1 year 2-D art or equivalent"}, "JROTC 4A": {"length": "Semester", "A-G": "X-Non A-G Elective", "grades": "12", "description": "While continuing to build upon the previous three years of JROTC instruction, JROTC 4 emphasizes service to the nation as well as exploring leadership principles associated with power bases, leadership styles, management skills and motivation. This curriculum also provides cadets instruction in multiple facets of personal finance. Additionally, cadets continue to explore career planning by further developing their individualized career and/or college preparation plans. Cadets act as assistant Instructors and enhance their teaching skills by developing lesson plans and delivering instruction using a variety of thinking maps and graphic organizers. The curriculum requires senior cadets to participate in a variety of individual and group projects and service learning programs.", "notes_prerequisites": "Students may take for one semester or pair with B for yearlong "}, "AP Environmental Science": {"length": "Yearlong", "A-G": "D-Science", "grades": "11-12", "description": "The goal of the AP Environmental Science course is to provide you with the scientific principles, concepts, and methodologies required to understand the interrelationships of the natural world, to identify and analyze environmental problems both natural and human-made, to evaluate the relative risks associated with these problems, and to examine alternative solutions for resolving and/or preventing them.", "notes_prerequisites": "Completion of SFUSD science graduation requirements required; Chemistry is recommended."}, "Orchestra 3 (full year)": {"length": "Yearlong", "A-G": "F-VPA", "grades": "9-12", "description": "This third-year orchestra course allows advanced level musicians to further develop their string technique and tonal control. They begin to independently monitor and modify their own pitch, diction, and interpretation. They evaluate performances based on more complex concepts and skills they learn, including modulations, cadences, and multiple types of scales. They employ more sophisticated terminology when discussing complex musical concepts and create longer and more intricate compositions, improvisations, and arrangements of music. Multiple opportunities to perform in different venues are provided both inside and outside the classroom, and solo and ensemble performances outside of the school day are encouraged.continued...", "notes_prerequisites": "Orchestra 2 or teacher recommendation required"}, "JROTC 1A": {"length": "Semester", "A-G": "X-Non A-G Elective", "grades": "9-12", "description": "The purpose of this course is to enable students to develop knowledge of the history, customs, traditions, and purpose of JROTC. The course includes development of basic leadership skills including leadership principles, values, and attributes. Students master appreciation for diversity. Financial planning as well as physical fitness, diet, nutrition, and healthy lifestyles, awareness of substance abuse and prevention, and basic first aid measures are included. An overview of the globe and geography and basic map reading skills are incorporated.                                                                      continued...", "notes_prerequisites": "Students may take for one semester or pair with B for yearlong "}, "Principles of Biotechnology 1": {"length": "Yearlong", "A-G": "D-Science", "grades": "11-12", "description": "Principles of Biotechnology 1 is a one-year course in the principles of biotechnology which will cover the history, present impact, and future potentials of this relatively new branch of science. The first part of the course focuses on the inheritance and physiology of genetic diseases and a review of Mendelian inheritance. The second part of the course focuses on key experiments in the history of DNA science as a model for studying the application of the scientific method. The third part of the course is on DNA chemistry and the structure and regulation of genes. The fourth section deals with the human genome and social, legal, and ethical issues engendered by the new technologies. The fifth section is an in-depth analysis of the immune system, AIDS, and impact and future potentials of biotechnology. Students learn basic genetics, molecular biology, biomedical research, and lab techniques.", "notes_prerequisites": "Completion of SFUSD Graduation Requirements required."}, "AP Statistics": {"length": "Yearlong", "A-G": "C-Math", "grades": "10-12", "description": "The AP Statistics course is equivalent to a one-semester, introductory, non-calculus-based college course in statistics. The course introduces students to the major concepts and tools for collecting, analyzing, and drawing conclusions from data. There are four themes in the AP Statistics course: exploring data, sampling and experimentation, anticipating patterns, and statistical inference. Students use technology, investigations, problem solving, and writing as they build conceptual understanding.", "notes_prerequisites": ""}, "Ethnic Studies": {"length": "Yearlong", "A-G": "G-Elective", "grades": "9-12", "description": "Ethnic Studies aims to educate students to be politically, socially, and economically conscious about their personal connections to local and global histories. By studying the histories of race, ethnicity, nationality, and culture; students cultivate respect and empathy for individuals and solidarity with groups of people so as to foster active social engagement and community building. This course is designed to develop an understanding of how race, ethnicity, nationality, and culture have shaped and continue to shape individuals and society in the United States. The course prepares students to participate in concurrent or subsequent social studies and literature courses with a solid understanding of historical trends and historical thinking.", "notes_prerequisites": ""}, "Economics": {"length": "Semester", "A-G": "G-Elective", "grades": "12", "description": "This course introduces students to fundamental economic concepts, institutions, and systems. Its purpose is to provide students with the necessary skills so that they become informed consumers, savers, members of the workforce, responsible citizens, and effective participants in the global economy. Students practice applying economic concepts in real-world scenarios, as well as analyzing economic data in order to make decisions and draw conclusions. This course emphasizes current events, projects, and debates in order to illustrate how economic principles are applied in the world and used to inform public policy, political ideology, and personal choices.                                                                                                                                             continued...", "notes_prerequisites": ""}, "Weight Training (full year)": {"length": "Yearlong", "A-G": "X-Non A-G Elective", "grades": "11-12", "description": "This course teaches the weight training concepts and techniques used for obtaining optimal physical fitness. Students benefit from comprehensive weight training and cardiorespiratory endurance activities. Emphasis is on safety, injury prevention, proper nutrition, anatomy, physiology, and proper utilization of free weights. Students are empowered to make wise choices, meet challenges, and develop positive behaviors in fitness, wellness, and movement activity for a lifetime.", "notes_prerequisites": ""}, "Technical Theater 3A": {"length": "Semester", "A-G": "F-VPA", "grades": "10-12", "description": "In Theater Tech 3, advanced students demonstrate mastery of stagecraft techniques introduced in previous years. Students assume the role of team leaders in their area of interest (e.g., lights, sound, design, construction, props, costumes, hair and makeup, stage management). They facilitate safety procedures, promote the professional work ethic of all students, adhere to project deadlines, supervise the construction of set units, and implement various practical applications of stagecraft for all students with special attention on teaching and mentoring all underclassmen. Students continue to explore design, construction, and production elements to become more well-rounded theater technicians through several major productions. Advanced students expectations include serving as a role model for all underclassmen in relationship to conducting themselves in a professional manner at all times.", "notes_prerequisites": "Students may take for one semester or pair with B for yearlong "}, "Library Training 1A": {"length": "Semester", "A-G": "X-Non A-G Elective", "grades": "10-12", "description": "Library Training 1 develops the library literacy and technology skills that students need in high school, college, and their future careers. The curriculum fosters critical thinking, social interaction, customer service skills, attention to detail, and creativity through hands-on training. This course covers the wide-range of information and literacy skills to navigate print and online contexts, which includes locating information from a variety of resources, discerning the validity of sources, citing information, organizing, creating and publishing products, and storing, retrieving, and sharing documents. Students write extensively and practice speaking and listening skills for a variety of audiences and purposes with close regard for tone and task. Students taking the class enjoy engaging in academic challenges, discovering online and print resources, working with the library staff, and assisting students.", "notes_prerequisites": "Students may take for one semester or pair with B for yearlong "}, "Chemistry, NGSS Honors": {"length": "Yearlong", "A-G": "D-Science", "grades": "10-12", "description": "Honors chemistry is an initial high school laboratory course that is designed to prepare students for both AP chemistry and post-secondary science classes through in-depth examination of the natural and physical world. It offers a fast-paced, rigorous curriculum that challenges students to apply chemistry knowledge to predict chemical phenomena, design experiments, and provide solutions to complex problems. Students integrate technology, mathematics, and chemical literacy into a wide range of chemistry topics that include, but are not limited to the following: periodicity, atomic structure, chemical bonding, gases, solutions, thermodynamics, acids and bases, equilibrium, kinetics, electrochemistry, organic chemistry, and nuclear chemistry. The class follows the NGSS Chemistry standards and provides inquiry-based curriculum. Students build a strong foundation of scientific inquiry through extensive, hands-on laboratory experience that requires students to write clear, concise, summative reflections outlining both quantitative and qualitative evidence gathered as a means to support or reject scientific claims.", "notes_prerequisites": "Completion of NGSS Biology and CCSS Algebra 1 required."}, "Art 1 (full year)": {"length": "Yearlong", "A-G": "F-VPA", "grades": "9-12", "description": "Art 1 serves as an introduction to visual art theory and applications in the area of drawing, painting, graphic design, and sculpture. Students develop a portfolio of their work that documents their progress throughout this course. Students complete several drawings in and out of the classroom to apply the technical skills they learn. Painting projects will focus on color theory and painting techniques. By the end of this course, students will be able to identify visual concepts in artwork and utilize the elements of art in their works. Students learn about aesthetics to make informed judgments about the artwork that surrounds their everyday lives.", "notes_prerequisites": ""}, "Band 3": {"length": "Yearlong", "A-G": "F-VPA", "grades": "9-12", "description": "Band 3 allows intermediate musicians to further develop their instrumental technique and tonal control. They begin to independently monitor and modify their own pitch, diction, and interpretation. Musicians study more complex musical concepts, notation, and vocabulary, including modulations, cadences, and multiple types of scales. They create longer and more intricate compositions, improvisations, and arrangements of music. Students perform a diverse repertoire in a variety of performance settings.", "notes_prerequisites": ""}, "AP Government and Politics: U.S. / Comparative": {"length": "Yearlong", "A-G": "A-History/Social Science", "grades": "12", "description": "AP U.S. Government and Politics provides a college-level, nonpartisan introduction to key political concepts, ideas, institutions, policies, interactions, roles, and behaviors that characterize the constitutional system and political culture of the United States. You will study U.S. foundational documents, Supreme Court decisions, and other texts and visuals to gain an understanding of the relationships and interactions among political institutions, processes, and behavior. You'll also engage in disciplinary practices that require you to read and interpret data, make comparisons and applications, and develop evidence-based arguments. In addition, you'll complete a political science research or applied civics project.AP Comparative Government and Politics introduces students to the rich diversity of political life outside the United States. The course uses a comparative approach to examine the political structures; policies; and the political, economic, and social challenges among six selected countries: Great Britain, Mexico, Russia, Iran, China, and Nigeria. Additionally, students examine how different governments solve similar problems by comparing the effectiveness of approaches to many global issues.", "notes_prerequisites": ""}, "Drama 2 (full year)": {"length": "Yearlong", "A-G": "F-VPA", "grades": "10-12", "description": "Drama 2 is a continuation theatre skills by covering intermediate-level acting skills, play analysis, scene and character study, international theatre, theatre history, and performance. Through increasing proficiency in movement, vocal work, scene work, and improvisation, students learn competencies that apply to all areas of employment. Such skills include confidence, creativity, collaboration, communication, and commitment. With a concentration on continuing the techniques of acting and the more practical side of preparation, this course is applicable for both those who want to break into the entertainment industry and those who want to reach their maximum potential in their professional lives.continued...", "notes_prerequisites": ""}, "AP Calculus AB": {"length": "Yearlong", "A-G": "C-Math", "grades": "11-12", "description": "Building enduring mathematical understanding requires understanding the why and how of mathematics in addition to mastering the necessary procedures and skills. To foster this deeper level of learning, AP Calculus AB is designed to develop mathematical knowledge conceptually, guiding you to connect topics and representations throughout the course and to apply strategies and techniques to accurately solve diverse types of problems.", "notes_prerequisites": ""}, "College/Career": {"length": "Semester", "A-G": "X-Non A-G Elective", "grades": "10-12", "description": "Plan Ahead is a semester-long course designed to help students map out and achieve their academic, personal, and career goals. The class gives students information to make smart decisions about what they want out of life—and how to accomplish it. Plan Ahead's curriculum aligns with national Common Core standards and focuses on skills assessments, career exploration, graduation requirements, 21st century skills, workplace readiness and financial literacy. The design of the curriculum also includes guest speakers and real-world experiences that help students explore multiple career options.", "notes_prerequisites": ""}, "Swimming (full year)": {"length": "Yearlong", "A-G": "X-Non A-G Elective", "grades": "10-12", "description": "This course is designed to develop basic to advanced swimming skills. Students are instructed on proper stroke techniques including the crawl stroke, backstroke, breaststroke, and butterfly stroke. Upon completion of this course, students demonstrate basic fundamental skills and stroke techniques. Students show competency in water safety and survival skills. Students are empowered to make wise choices, meet challenges, and develop positive behaviors in fitness, wellness, and movement activity for a lifetime.", "notes_prerequisites": ""}, "Symphony Orchestra (full year)": {"length": "Yearlong", "A-G": "F-VPA", "grades": "9-12", "description": "Symphony Orchestra is an advanced level performing ensemble for strings, woodwinds, brass, and percussion. This class will focus on performing as a full symphonic orchestra. Students begin to independently monitor and modify their own pitch, diction, and interpretation. They evaluate performances based on more complex concepts and skills they learn, including modulations, cadences, and multiple types of scales. They employ more sophisticated terminology when discussing complex musical concepts and create longer and more intricate compositions, improvisations, and arrangements of music. Multiple opportunities to perform in different venues are provided both inside and outside the classroom, and solo and ensemble performances outside of the school day are encouraged.continued...", "notes_prerequisites": "Must have taken Orchestra 3"}, "JROTC 3A": {"length": "Semester", "A-G": "X-Non A-G Elective", "grades": "11-12", "description": "The primary purpose of this course is to enable students to expand on skills JROTC 2. This course introduces the students to basic Command and Staff principles, leadership planning and development of leadership strategies. Students improve and refine their Drill and Ceremony skills at both the platoon and company levels. Public speaking and presentation skills are emphasized, both in classroom and real-world environments. The course also emphasizes managing conflict, career planning, social responsibility, financial planning and critical thinking. Additionally, this course focuses on wellness and physical fitness, current events awareness and analysis and community service event planning and participation.", "notes_prerequisites": "Students may take for one semester or pair with B for yearlong "}, "Racket Activities (full year)": {"length": "Yearlong", "A-G": "X-Non A-G Elective", "grades": "10-12", "description": "This course provides students with the opportunity to develop skills in tennis, pickle-ball, table tennis, and badminton. Students learn the forehand, backhand, serve, and volley for each sport. They play both singles and doubles in each sport. Theories, rules and regulations, techniques, strategies and tactics, positive social skills, and safety are emphasized. Students are expected to demonstrate knowledge and competency in racket sports. They are empowered to make wise choices, meet challenges, and develop positive behaviors in team activities, aerobic fitness, wellness, and movement activity.continued...", "notes_prerequisites": ""}, "French 1": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "9-11", "description": "French 1 is a beginning language course that enables students to understand vocabulary, communicate, read, and write French. Students listen, respond, and practice French in simulated, realistic situations. Students have opportunities to perform the communicative functions of socializing, exchanging information, counting, expressing feelings and emotions, and persuading as they learn the language structures needed to perform these skills. Learners engage in critical thinking though analysis and comparisons of culture and language. Students compare their culture to the French culture, as well as the 33 Francophone nations using French as their official language or second official language. Students watch French films, create basic French dishes, sing French songs, participate in French heritage festivals, report on important French historical figures, and listen to elementary level podcasts.", "notes_prerequisites": ""}, "French 3 Honors": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "9-12", "description": "Students explore six themes throughout French 3, learning the essential vocabulary, cultural awareness, and advanced grammar needed to express themselves accurately and intelligently in writing and in conversation. Students are required to participate actively in debates; analyze literature; read, listen to, and understand online sources; write essays, stories, blog posts; and engage in other interpersonal communication with their peers. French is spoken at all times. The class views a number of French movies linked to the main themes of the textbook and supplemental literary works.continued...", "notes_prerequisites": ""}, "AVID 3": {"length": "Yearlong", "A-G": "G-Elective", "grades": "11", "description": "The AVID course is an elective class for students who are college-bound. The AVID curriculum focuses on writing, inquiry, collaboration and reading (WICR) through the AVID High School curriculum in both teacher and tutor-led activities. While concurrently enrolled in a college-prep course of study, students learn strategies to enhance success. Note-taking, outlining, writing, speaking, reading, test-taking strategies, and self-awareness are stressed. In addition, the course includes college motivational activities and intensive preparation for ACT, SAT I and SAT II.", "notes_prerequisites": "AVID 2 or approval from the AVID coordinator required"}, "Chemistry, NGSS": {"length": "Yearlong", "A-G": "D-Science", "grades": "10-12", "description": "Using the guidance of the CA Framework's High School 3-Course Model, NGSS Chemistry includes both Physical and Earth and Space Science performance expectations integrated in a strategic way, so that students apply their knowledge of physical science concepts in the context of Earth and Space Science. The Earth and Space Science topics of stars and climate change are embedded into this NGSS Chemistry course. Developed using the 5E Instructional Model, in this NGSS Chemistry course, the story of chemistry progresses from a microscopic to macroscopic understanding of the world around us. Starting with the atom and where elements come from, students progress to bonding, chemical reactions and the energy changes connected to reactions. In spring, student learning is contextualized by using different climate change phenomena to learn about energy balance, albedo, gases, rates of reaction, equilibrium, solutions and acids and bases.continued...", "notes_prerequisites": "Completion of NGSS Biology and CCSS Algebra 1 required."}, "AP Calculus BC": {"length": "Yearlong", "A-G": "C-Math", "grades": "11-12", "description": "Building enduring mathematical understanding requires understanding the why and how of mathematics in addition to mastering the necessary procedures and skills. To foster this deeper level of learning, AP Calculus BC is designed to develop mathematical knowledge conceptually, guiding you to connect topics and representations throughout the course and to apply strategies and techniques to accurately solve diverse types of problems. Calculus BC includes all topics covered in Calculus AB plus additional topics, and is designed to qualify you for placement and credit in a course that is one course beyond what's granted for Calculus AB.", "notes_prerequisites": ""}, "American Democracy": {"length": "Semester", "A-G": "A-History/Social Science", "grades": "12", "description": "American Democracy is a one-semester course that develops students' understanding of the American government. Emphasis is placed on investigating the principle processes through which the American political system functions as well as the public policies these institutions establish. Students look primarily at national politics and the national government from past through present. Students examine, explore, and investigate the following topics: nation's founding principles established in the Constitution; relationship between citizens and the government; nature of civil society in a democracy; three branches of government and the checks and balances between them; the relationships between federal, state, and local governments; landmark Supreme Court decisions that have shaped these principles and institutions; nature of local, state, and national elections.", "notes_prerequisites": ""}, "Latin 3": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "9-12", "description": "Latin 3 deepens the study of the Latin language and the classical culture. Students learn vocabulary, grammar, syntax, and culture through stories. They study Latin words and compare them with English words derived from Latin roots. Reading, translating, listening and writing are part of students' daily practice in order to develop vocabulary and understanding of the grammar and syntax. As students have developed a good understanding of the Latin language, they read and analyze classical prose and some poetry in original form.", "notes_prerequisites": ""}, "Basketball (full year)": {"length": "Yearlong", "A-G": "X-Non A-G Elective", "grades": "10-12", "description": "This course is designed to give students the opportunity to learn and develop the fundamental and advanced skills, team tactics, rules and strategies of basketball. Students will learn and develop basic individual skills such as ball handling, dribbling, shooting, passing and defending, and team tactics. Theories, rules and regulations, techniques, strategies and tactics, positive social skills, and safety are taught and emphasized during this course. Students are expected to demonstrate knowledge and competency in all basketball related skills. Students are empowered to make wise choices, meet challenges, and develop positive behaviors in team activities, aerobic fitness, wellness, and movement activity for a lifetime.", "notes_prerequisites": ""}, "AP Physics 1": {"length": "Yearlong", "A-G": "D-Science", "grades": "10-12", "description": "AP Physics 1 is an algebra-based, introductory college-level physics course. Students cultivate their understanding of Physics through inquiry-based investigations as they explore topics such as Newtonian mechanics (including rotational motion); work, energy, and power; mechanical waves and sound; and introductory, simple circuits.", "notes_prerequisites": "Completion of CCSS Algebra 1 required."}, "Environmental Science": {"length": "Yearlong", "A-G": "D-Science", "grades": "11-12", "description": "The purpose of the Environmental Science course is to give students an empowering understanding of the rapidly changing world through a multidisciplinary approach that includes earth science, biology, chemistry, and physics. As man's population increases, our impact on the environment requires vigorous study in order to design solutions that ensure the sustainability of the world's resources, including, but not limited to fossil fuels, alternative energy, agriculture, world's forestry, biodiversity, climate management, and water. The course also examines environmental economics and policy. Together these topics are aimed to encourage stewards of the planet and an informed future voting population. Understanding the world around us and our impact on the world develops students into critical thinkers and responsible earth inhabitants.", "notes_prerequisites": "Completion of SFUSD Graduation Requirements required."}, "Spanish for Native Speakers 3 Honors": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "9-12", "description": "Spanish for Native Speakers 3 Honors is a class for Heritage learners of Spanish with a high intermediate oral and aural level, and at least a low intermediate level in reading and writing. The course is conceived as a pre-AP that builds on abilities developed in Spanish for Native Speakers 2. Content for the first semester provides students with opportunities to explore the nature and potential of being between worlds and the importance and advantages of being bilingual. Content for the second semester explores topics involving Spanish speaking communities, school, and global issues.The course is proficiency-based, implying that all activities within the course are aimed at placing the learner in the context of the native-speaking environment. The class is completely conducted in Spanish and there is an expectation for students to communicate in the language. Learners are provided opportunities to participate in interpersonal, interpretive, and presentational communication; using the language to investigate cultural practices and products and reflect on the perspectives that underlie them; acquire knowledge and new perspectives from authentic target language sources; learn about the nature of language and culture and how each manifests itself in human communication. The course includes a review of the grammar rules and the orthography of Spanish. Students will read and write intermediate-high level compositions. In addition, students will give oral presentations, and participate in discussions about researched topics.", "notes_prerequisites": "For students whose home language is Spanish or are from a Middle School immersion program."}, "Art 2 (full yer)": {"length": "Yearlong", "A-G": "F-VPA", "grades": "10-12", "description": "Art 2 is designed for advanced art students as a portfolio skill-building class. Students will further their course of study by applying advanced concepts they learned in Art 1. Learning and improving on new art techniques will be a focus of this course, including further experimentation with graphite, charcoal, oil and chalk pastels, combination of ink and watercolor, color pencils, acrylic and oil paint. Students participate in direct observation studies (recorded in their sketchbooks) throughout the course as opportunities for skill building. Students create individual artworks based on their responses to historical, philosophical and cultural prompts. Meanwhile, they continue their exploration of artistic perception and art production. Students will build on previous experiences with design elements and principles, as well as knowledge of art movements to create quality works of art. Their cumulative work will be expressed in their final showcase portfolio.", "notes_prerequisites": ""}, "Algebra 2 CCSS + Precalculus": {"length": "Yearlong", "A-G": "C-Math", "grades": "11-12", "description": "This is the third course for high school students aligned to the Common Core State Standards. The course has a strong focus on expanding students' understanding of functions and generalizing function properties to transform a variety of functions, including: constructing and comparing linear and exponential models; transforming and modeling situations with a variety of function families (including quadratic, square root, absolute value); understanding the unit circle and trigonometric functions (sine, cosine, tangent, and the reciprocal functions), modeling periodic phenomena; working with polynomial and rational expressions and functions. In statistics, topics include understanding the properties of the normal curve, random processes, statistical experiments, and making inferences and justifying conclusions. This course covers additional topics beyond Algebra 2 to prepare students for AP Calculus, which include the following: trigonometric identities, composition of functions, piecewise functions, logarithmic functions, and inverse functions.", "notes_prerequisites": ""}, "Guitar 1 (full year)": {"length": "Yearlong", "A-G": "F-VPA", "grades": "9-12", "description": "Guitar 1 delivers beginning instrumental music instruction, including note reading and rhythm comprehension. Learners demonstrate their understanding of chord symbols, music theory, and appropriate playing technique on the guitar. Students read standard music notation by sight reading music examples and develop strumming and picking techniques by playing a wide variety of chord progressions. Ear training and aural skills are also cultivated. The student may continue to the next level with the purpose of either playing for enjoyment or continuing in music as a profession.", "notes_prerequisites": ""}, "Chinese 2": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "9-12", "description": "This course is a continuation of Chinese 1. It uses a holistic approach to develop reading, writing, speaking and listening skills of Chinese language. Chinese 2 begins with a comprehensive review of grammatical structures that facilitate further speaking and reading. Students start to construct paragraphs. At the end of the year, students are able to conduct basic daily communication in real-life situations, read simple texts as well as write for daily needs. Accurate and more precise tones and pronunciation are expected. The goal for this class is to encourage students' natural language acquisition through listening, speaking, reading and writing practice while promoting the 21st century skills in critical thinking, curiosity, creativity, and responsibilities of being global citizens.", "notes_prerequisites": ""}, "Architecture 2A": {"length": "Semester", "A-G": "F-VPA", "grades": "9-12", "description": "Architecture 2 focuses on the study and application of the design process while infusing the history of American residential architecture (e.g., architectural language, meaning, structure, design trends). The emphasis is on expressing creativity in a visual form by (1) reviewing and applying the elements and principles of design; and (2) delving deeper into the inspirations, theoretical elements, and principles behind good design. Students follow the stages of the design process by completing a project from site analysis to a finished building design, creating it in 3D form.continued...", "notes_prerequisites": "Students may take for one semester or pair with B for yearlong "}, "Geometry B / Algebra 2A (Off Semester)": {"length": "Yearlong", "A-G": "C-Math", "grades": "10-12", "description": "This is the second mathematics course for high school students aligned to the Common Core State Standards for mathematics. The course begins with transformations in the plane, concept of congruence through rigid motions, and similarity through dilations. Relationships established through transformational geometry are used to prove geometric theorems. Similarity leads to a study of right triangles and trigonometric ratios. A focus on expressing geometric properties with equations leads to using coordinates to prove theorems algebraically. The course also examines relationships between 2- and 3-dimensional objects, including volume formulas and modeling with geometry. The fundamental goal is for students to make sense of the mathematics they learn, and for this reason all units are designed around four challenging tasks connected by lesson series. The tasks require that students find patterns, make and test conjectures, use multiple representations and approaches, make generalizations, and verify that solutions are reasonable in a given context.Algebra 2  is aligned to the Common Core State Standards. The course continues the previous work on functions, which includes building a function that model a relationship between two quantities and building new functions from existing functions (linear and nonlinear); constructing and comparing linear and exponential models; understanding trigonometric functions (sine and cosine), unit circle, modeling periodic phenomena, and proving and applying Pythagorean Identity; using polynomial identities, rewriting rational functions; understanding random processes, statistical experiments, and making inferences and justifying conclusions; understanding conditional probability, rules of probability, compound events, expected value, and using probability to evaluate outcomes of decisions. The fundamental goal is for all students to make sense of the mathematics they are learning, and for this reason all units are designed around four challenging tasks continued...", "notes_prerequisites": "For sophomores or juniors who earned a D or F in the spring semester of Geometry & did not take credit recovery"}, "AP Microeconomics / Macroeconomics": {"length": "Yearlong", "A-G": "G-Elective", "grades": "12", "description": "AP Microeconomics is an introductory college-level course that focuses on the principles of economics that apply to the functions of individual economic decision-makers. The course also develops students' familiarity with the operation of product and factor markets, distributions of income, market failure, and the role of government in promoting greater efficiency and equity in the economy. Students learn to use graphs, charts, and data to analyze, describe, and explain economic concepts.AP Macroeconomics is an introductory college-level course that focuses on the principles that apply to an economic system as a whole. The course places particular emphasis on the study of national income and price-level determination; it also develops students' familiarity with economic performance measures, the financial sector, stabilization policies, economic growth, and international economics. Students learn to use graphs, charts, and data to analyze, describe, and explain economic concepts.", "notes_prerequisites": ""}, "Marine Science": {"length": "Yearlong", "A-G": "D-Science", "grades": "11-12", "description": "Marine Science introduces students to the physical and biological \"world\" of the oceans. It is an ecologically based course that emphasizes the relationship between biotic (living) factors and abiotic (non-living) factors. Students examine the importance of the world's oceans' role on Earth's global climate and the scientific principles that govern organisms and their association with the environment. The course begins with the chemistry of water, plate tectonics, geography, ecology, and then embarks on an in-depth study of the diverse marine communities that can be found throughout the world. The class concludes with a study of the human impact on the sea: an analysis of global fishing practices, underwater mining, water pollution, ocean acidification, and global warming.", "notes_prerequisites": "Completion of SFUSD Graduation Requirements required."}, "Photography 2 (spring semester only)": {"length": "Semester", "A-G": "F-VPA", "grades": "9-12", "description": "Students entering Photography 2 are expected to be experienced with a manual DSLR camera and with Adobe Photoshop editing skills. They learn to plan and execute longer and increasingly complex projects, resulting in a series of final images for each assignment. Students use advanced experimental Photoshop techniques to further manipulate their images for planned special effects. Project assignments become more conceptual, allowing students to illustrate more personal themes in their work. They are expected to refine their camera and editing skills so that they are at presentation level.", "notes_prerequisites": ""}, "Chinese 1": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "9-12", "description": "This introductory course in Chinese language provides the basic communication skills in the modern standard Chinese. Chinese 1 is designed for students who have had little or no prior knowledge of Mandarin. The main objectives include developing students' linguistic proficiency, promoting cultural sensitivity, and developing overall fluency. The course is balanced between communicative content and language structure/forms. Students learn to read and speak Mandarin in the pinyin system. Students will gain the ability to write characters and simple sentences.", "notes_prerequisites": ""}, "Korean 3 Honors": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "9-12", "description": "Korean 3 Honors is a third-year language course that furthers students' abilities in conversation, reading, and writing. Students continue to learn the elements of Korean grammar and expand their communication abilities to understand and produce complex levels of oral and written language. The course prepares students to demonstrate their level of Korean language proficiency across three communicative modes and five goal areas (i.e., cultures, connections, comparisons, communities, and communication).", "notes_prerequisites": ""}, "Korean 1": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "9-11", "description": "Korean 1 is a yearlong, introductory course on the development and structure of the Korean language. The first year course offers the basic elements of reading, writing, speaking, and listening. Students use orthography (writing system of Hangul) and phonology (sounds system) to understand and produce words and phrases in context. Students apply their knowledge of the written and spoken language in highly predictable common daily settings. In addition, they develop an appreciation of Korean customs and history appropriate for their course level. By the end of this course, students have the necessities appropriate for a first-year Korean language learner. This course aligns to the five categories of standards - content, communication, cultures, structures, and settings - and prepares students to demonstrate their Korean language proficiency across three communicative modes.", "notes_prerequisites": ""}, "Yearbook A (fall semester)Yearbook B (spring semester)": {"length": "Semester", "A-G": "X-Non A-G Elective", "grades": "9-12", "description": "Yearbook provides students with the journalism, photography, and design skills to produce a yearbook. The final product is the school's current yearbook. This class is run like a small business where staff members demonstrate a high level of responsibility, maturity, and organization.", "notes_prerequisites": "Students may take for one semester or pair together for yearlong "}, "AP English Language and Composition": {"length": "Yearlong", "A-G": "B-English", "grades": "11", "description": "The AP English Language and Composition course is designed to help students become skilled readers of a variety of texts as well as becoming skilled writers. Students will achieve this through awareness of the interactions among a writer's purposes, audience expectations, and subjects, as well as the ways that writing rules and language use contribute to effective writing. Skill in writing proceeds from students' awareness of their composing processes: the way they explore ideas, reconsider strategies, and revise their work. This experience of the process of composing is the essence of the first-year college writing course, and the AP English Language and Composition course emphasizes this process. In the course, students will write essays that proceed through several stages or drafts, with revision aided by your teacher and peers. These extended, revised essays are not part of the AP English Language and Composition Exam, but the experience of writing them will help students become more self-aware and flexible writers. In addition to engaging in varied writing tasks, students will read and become acquainted with a wide variety of prose styles from many disciplines and historical periods. Due to the increasing importance of graphics and visual images in texts published in print and electronic media, students will learn to analyze images as they relate to written texts and serve as alternative forms of texts themselves. Using research materials and synthesizing information from various sources are integral parts of the AP English Language and Composition course. Students will learn to evaluate the legitimacy and purpose of sources used. One way to do this is through the researched argument paper, which will require students to sort through various interpretations of information to analyze, reflect upon, and write about a topic. When students bring the experience and opinions of others into their writing in this way, they enter into conversations with other writers and thinkers, which in turn helps your writing become more thoughtful and substantive.", "notes_prerequisites": "Juniors will have an opportunity (space permitting) to choose from one of the themed pairings below in Arena: + Journey through Hell / Knight in Not-So-Shining Armor+ Knight in Not-So-Shining Armor / The Heroine+ 20th Century American Writers / The Heroine+ 20th Century American Writers / Literature and Philosophy"}, "Jazz Band (full year)": {"length": "Yearlong", "A-G": "F-VPA", "grades": "9-12", "description": "Jazz Band completes the musical education of advanced students by connecting their performance skills with their ability to investigate and solve musical challenges. Students perform alone and in small groups, making appropriate personal choices of tone, interpretation, and musicality. They study a diverse repertoire, focusing on multi-movement works, 20th century notation, and music of the Americas. They develop an expanded knowledge of scales and cadences, create compositions with multiple parts, and evaluate musical performances at an advanced level. Students round out their studies learning instrument development, form analysis in works from different backgrounds, and the composition process for film.", "notes_prerequisites": "Audition required"}, "Italian 3": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "9-12", "description": "Italian 3 is an advanced language course that enables students to communicate, read, and write in Italian. Students practice Italian in simulated, realistic situations. As they learn the language structure, they perform the communicative functions of socializing, exchanging information, counting, expressing feelings and emotions, and persuading. They express themselves in past, present, and future tenses. Learners engage in critical thinking through analysis and comparisons of culture and language, and explore the target language beyond the classroom in real-world interactions within their own community. Students compare their culture to the Italian culture. They watch Italian films, create more complicated Italian dishes, sing Italian songs, participate in Italian heritage festivals, and report on important Italian historical figures.", "notes_prerequisites": ""}, "Korean 2": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "9-12", "description": "Korean 2 is a second-year language course that furthers students' abilities in conversation, reading, and writing. Students continue to learn the basic elements of Korean grammar and expand their communication abilities to understand and produce a more complex level of oral and written language. The course prepares students to demonstrate their level of Korean language proficiency across three communicative modes and five goal areas (i.e., cultures, connections, comparisons, communities, and communication).", "notes_prerequisites": ""}, "Library Training 2A": {"length": "Semester", "A-G": "X-Non A-G Elective", "grades": "11-12", "description": "Library Training 2 continues to develop the library literacy and technology skills covered in Library Training 1. The curriculum fosters critical thinking, social interaction, customer service skills, attention to detail, and creativity through hands-on training. This course covers the wide-range of information and literacy skills to navigate print and online contexts, which includes locating information from a variety of resources, discerning the validity of sources, citing information, organizing, creating and publishing products, and storing, retrieving, and sharing documents. Students write extensively and practice speaking and listening skills for a variety of audiences and purposes with close regard for tone and task. Students taking the class enjoy engaging in academic challenges, discovering online and print resources, working with the library staff, and assisting students.", "notes_prerequisites": "Students may take for one semester or pair with B for yearlong "}, "Technical Theater 2A": {"length": "Semester", "A-G": "F-VPA", "grades": "10-12", "description": "Theater Tech 2 continues to develop the stagecraft techniques from the previous year. Students further explore design, construction, and production elements to become well-rounded theater technicians through several major productions. A primary student role is mentoring students in Theater Tech 1 and actively monitoring new students to adhere to the safety standards in the shop and on the stage. Intermediate students assist in supervising new students with overseeing their basic construction skills, guiding them with advanced building techniques, critical thinking in design, and troubleshooting issues related to production. Intermediate students begin to serve in leadership roles as crew leads on various productions.", "notes_prerequisites": "Students may take for one semester or pair with B for yearlong "}, "French 2": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "9-12", "description": "French 2 is a continuation of French 1. Students acquire about 600-650 new vocabulary words. They begin more sophisticated conversations on thematic topics as they understand more vocabulary and grammar. Students continue to listen, respond, and practice French in simulated, realistic situations. Students have opportunities to perform the communicative functions of socializing, exchanging information, counting, expressing feelings and emotions, and persuading, while learning the language structures needed to perform these skills. Learners engage in critical thinking though analysis and comparisons of culture and language. Students also continue with French songs, participate in French heritage festivals, report on important French historical figures, and listen to intermediate-level podcasts. The grammar emphasis is on reflexive verbs, the compound past, and irregular past participles.", "notes_prerequisites": ""}, "AP Chemistry": {"length": "Yearlong", "A-G": "D-Science", "grades": "11-12", "description": "With the ever-increasing need for innovators, problem finders, and designers of materials, pharmaceuticals, and even new fuels, comes the need for individuals skilled in the science practices and knowledgeable about chemistry. The AP Chemistry course provides students with training for such knowledge and skills through guided inquiry labs, a focused curriculum on content relevant to today's problems, and an exam that assesses students' mental models of the particulate nature of matter instead of memorization of rules to understand chemistry.", "notes_prerequisites": "Passing grade in NGSS Chemistry or Chemistry Honors required"}, "Spanish 2": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "9-12", "description": "Spanish 2 expands on the language skills from the first year with an emphasis on listening and speaking. Learners are provided language-use activities that enable them to do the following: function in transactional settings and in some informal situations; understand the overall meaning and key ideas in texts; comprehend and produce oral and written sentences. Students use the language to investigate and observe cultural practices and reflect on the perspectives that underlie them. In addition, this course aims to promote global citizenship and 21st century skills by providing the students with opportunities to think critically through constant analysis, comparison, and evaluation of content, culture, and language.", "notes_prerequisites": ""}, "Computer Programming (Year Long)": {"length": "Yearlong", "A-G": "G-Elective", "grades": "10-12", "description": "Computer Programming is an introduction to computing science through an interactive programming language, Javascript and Python. Previous computing experience is not required. The course requires supervised work in the computer laboratory, in addition to lecture and guided practice. This course introduces concepts that are covered in more detail in AP Computer Science A.", "notes_prerequisites": "For students with little to no programming knowledge"}, "AP Human Geography": {"length": "Semester", "A-G": "A-History/Social Science", "grades": "10-12", "description": "The AP Human Geography course is equivalent to an introductory college-level course in human geography. The course introduces students to the systematic study of patterns and processes that have shaped human understanding, use, and alteration of Earth's surface. Students employ spatial concepts and landscape analysis to examine socio economic organization and its environmental consequences. They also learn about the methods and tools geographers use in their research and applications. The curriculum reflects the goals of the National Geography Standards (2012).continued...", "notes_prerequisites": ""}, "Chinese for Native Speakers 3": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "9-11", "description": "The purpose of this class is to enhance the students in listening, reading, writing, speaking and to prepare students to attend AP Chinese class in the next school year. The course advances to demand more extensive reading and conversations on contemporary China and the US and World event, reading writing of longer text, and reading of short passages. Students will be introduced to read and appreciate Chinese poems, modern poetry and ancient poetry. The course is proficiency-based, implying that all activities within the course are aimed at placing the learner in the context of the native-speaking environment from the very beginning. Learners are provided opportunities to participate in interpersonal, interpretive, and presentational communication; using the language to investigate cultural practices and products and reflect on the perspectives that underlie them; acquire knowledge and new perspectives from authentic target language sources; learn about the nature of language and culture and how each manifests itself in human communication; and take language beyond the classroom in real-world interactions. In addition, this course aims to promote 21st century skills by providing the students with opportunities to think critically through constant analysis, comparison, and evaluation of content, culture, and language. The students will have opportunities to work cooperatively with their classmates. Also, the course integrates many learning technology tools that will help to promote the students' technology literacy.", "notes_prerequisites": "For students whose home language is Mandarin or are from a middle school Mandarin immersion program"}, "Piano Lab 1 (full year)": {"length": "Yearlong", "A-G": "F-VPA", "grades": "9-12", "description": "Piano Laboratory provides for the development of musical skills through the study and performance of keyboard literature suited to various levels of instruction. Skill development is sequential.", "notes_prerequisites": ""}, "AP European History": {"length": "Yearlong", "A-G": "A-History/Social Science", "grades": "10-12", "description": "AP European History is designed to be the equivalent of a two-semester introductory college or university European history course. In AP European History students investigate significant events, individuals, developments, and processes in four historical periods from approximately 1450 to the present. Students develop and use the same skills, practices, and methods employed by historians: analyzing historical evidence; contextualization; comparison; causation; change and continuity over time; and argument development. The course also provides six themes that students explore throughout the course in order to make connections among historical developments in different times and places: interaction of Europe and the world; poverty and prosperity; objective knowledge and subjective visions; states and other institutions of power; individual and society; and national and European identity.", "notes_prerequisites": ""}, "Dance Production A (fall semester)": {"length": "Semester", "A-G": "F-VPA", "grades": "10-12", "description": "Dance Production introduces students to the vocabulary and technical skills required for basic dance styles. Styles learned over the year include but are not limited to ballet, jazz, modern, tap, musical theatre, social, and Latin dance. Creative expression, music interpretation, dance sequences, and choreography elements are all essential components for students to master. Students may perform in front of a school or community audience regularly as they apply the learned skills.", "notes_prerequisites": "Students may take for one semester or pair with B for yearlong "}, "Vocal Music 3 (full year)": {"length": "Yearlong", "A-G": "F-VPA", "grades": "9-12", "description": "Vocal Music 3 (Treble Choir) is designed for high/treble voices. Students in this course demonstrate previous vocal experience or completion of Vocal Music 1 and 2. Students will receive advanced instruction in aspects of singing, which include theory, terminology, ear training, sight reading, and advanced performance practices. Emphasis is placed on developing ensemble singing (i.e. balance, blend, and intonation). A more sophisticated understanding of the nature, structure, and meaning of music is accomplished through the study and performance of more advanced choral literature. Students are expected to attend all scheduled performances.", "notes_prerequisites": ""}, "Upper Division Junior/Senior English A & B(Non AP)": {"length": "Semester", "A-G": "B-English", "grades": "11-12", "description": "+Juniors not taking AP English will select Critical Writing plus one other Upper Division English class  from the options below during Arena to complete the full year.+Seniors not taking AP English will select two different Upper Division English classes from the options below during Arena to complete the full year.American Literature: Voices and Visionaries (offered fall & spring)American Literature: The Short Story (offered fall & spring)American Literature is centered around the SFUSD E/LA PK-12 Core Curriculum with embedded CCSS. Students study a range of representative works from pre-colonial America to the present, examining important themes in American culture (e.g., the American Dream, modernism, individuality, mobility, race, the Westward Expansion, and the immigrant experience). Students engage in critical analysis of literary and expository texts while becoming more fully aware of cultural and ethnic diversity, values, customs and beliefs in America. Students develop as critical readers and skilled writers, honing their listening and speaking skills as they engage in formal academic discourse and examine different perspectives and experiences.continued...Comedy & Satire (offered fall only)This course explores the critical role comedy has played in Western culture throughout time. Students learn how comedy has and continues to serve as a lens through which to define self, critique societal and cultural norms, and challenge stereotypes and status quo. Students extensively read plays, novels, short stories and articles. They are also exposed to various media (e.g., films, television shows, advertisements, websites) that support the analysis of comedy as a touchstone for critical thinking. Students delve into some of the history of Western comedy and examine the present role of comedy in bridging divides and exposing the hypocrisies and idiosyncrasies of our humanity.*Critical Writing (offered fall and spring) This is a writing intensive course focusing on the techniques and principles of persuasive writing for academic purposes. It emphasizes the following: principles of logical argument, advanced rhetorical modes, critical reasoning, and effective use of source material, research, citation skills, and stylistics. *Juniors must take this course plus one other Upper Division optionEnglish/European Literature: Gothic Literature (offered fall & spring)In this course, students examine British, European and World literature from a variety of authors. Students learn to contrast major literary forms, techniques, and characteristics of the literary periods. Through academic discussion and writing, students relate literary works and authors to the major themes and issues of their eras and evaluate the philosophical, political, religious, ethical, and social influences of the historical period. Students analyze the way in which authors used archetypes drawn from myth and tradition in literature. Additionally, students will engage in academic research and discourse using databases and other digital media sources. Epic and Mythology (offered fall & spring)Epic & Myth introduces the terminology and content of core western (Greek, Roman, Norse) and world myths, legends and folklore. Beginning with a comparative study of creation myths, the course emphasizes Western sources of Greek, Roman and Norse myth, then branches into Russian, Native American and Eastern mythology through selected readings, film and artwork. Students engage in daily critical investigation, interpretation, reading, writing, discussion, and projects generated by their study.Film as Literature (offered fall & spring)Too often, students \"turn off their brains\" when watching a film, believing that while books are meant for analysis, movies are meant only for entertainment, and therefore not worth thinking about. This course is designed to alter that perception and teach students how to analyze, discuss, and write about classic and modern film. Students learn to critically analyze the building blocks of film, including the mise-en-scene, cinematography, editing, and sound design. They then apply that knowledge to dissect various categories of film. This is a writing intensive course, in which movies are examined in the same way as literature in an English course.Literature and Philosophy (offered fall only)Literature & Philosophy teaches reasoning and critical thinking skills through the examination of philosophy in literature and demonstrates how thoughts are acted out through daily action. This course is an introductory seminar to philosophical thought in fiction and explores how our metaphysical views, or our views on being, existence, and reality, shape our reality. Students examine how these metaphysical views are developed through logic, observation, and bias. Students develop stronger senses of self and activism through the practice of transforming profound thinking from conceptual to practical. They are exposed to various forms of literature including essays, novels, and poetry; students will complete reflection pieces, short stories, research papers, essays, and oral and visual presentations.Literature and Philosophy: Ethics of Eating (offered spring only)Sustainably farmed carrots, pastured chicken eggs, grass-fed beef, Frankenfoods: What does it all mean, and what does it have to do with us? This course explores food-production and consumption issues, seeking answers to essential questions that are central to the way we live our lives. While the course naturally incorporates discussion of the science related to the major topics and essential questions, its primary focus is on the aesthetic, cultural, moral, and ethical dimensions of the many choices we make when we decide what to eat.continued...Literature and Psychology (offered spring only)Literature & Psychology explores the human psyche through exploration of \"villainous\" characters in literature (e.g., plays, short stories, novels) and film. Among others, students will read Cormac McCarthy, Arthur Miller, Stephen King, Truman Capote, and Janet Fitch as well as research on psychopathy and narcissism to develop a conceptual framework to examine motivation and character in various contemporary works. Students examine the social contexts these characters are presented in and analyze whether the archetypes are informed by social/cultural anxieties. Students read extensively, participate in Socratic Seminars, and build on their analytical writing skills through expansive composition.Novel (offered fall and spring)This course develops students' analytic and critical thought about narrative choices as well as guides students along the steps of writing an extended fictional work. It bolsters understanding of the use of setting, plot, style, theme, and characters to communicate their creative vision. Students use a writer's lens to read a variety of professional models of fiction as well as non-fiction pieces about writing. Students participate in skill building writing exercises that include annotation, analytical writing, discussion, journaling, and feedback. Upon the completion of this semester, students have completed one multi-paragraph literary analysis, a draft of an extended work of fiction, and revision of the first 10 pages of their extended works.Science Fiction and Fantasy (offered fall and spring)This course provides students with challenging and extensive reading of texts within the science fiction and fantasy genre including epics, graphic novels, short stories, and films. Students examine fantasy and science fiction in relation to escapism, contribution to cultural legends, and socio-political commentary on issues. They analyze the impact of structure and tone on the work. Students read for comprehension of content as well as evaluation of author's purpose and biases and build writing skills through vocabulary development, grammar review, and draft writing. They use critical thinking in Socratic discussions of various works and collaborate in literature circles to analyze, synthesize, and compare genres from a student centered perspective.Shakespeare (offered fall and spring)This course aims to produce thoughtful and creative readers of Shakespeare's works via extensive reading, writing, and discussions on his various works (i.e., sonnets, comedies, histories, tragedies). Students gain understanding of the historical contexts of Shakespeare's works, perform critical analysis, and increase their sense of the range of human experience and written expression. They incorporate practices of access, evaluation, and information processing to inform their own knowledge production including literary critique, seminar discussions, and presentations. Students construct sound evidence based points of view and synthesize works to convey complex and multifaceted information.", "notes_prerequisites": "Juniors & seniors must select both A & B if not taking AP English"}, "Geometry CCSS": {"length": "Yearlong", "A-G": "C-Math", "grades": "10", "description": "This is the second mathematics course for high school students aligned to the Common Core State Standards for mathematics. The course begins with transformations in the plane, concept of congruence through rigid motions, and similarity through dilations. Relationships established through transformational geometry are used to prove geometric theorems. Similarity leads to a study of right triangles and trigonometric ratios. A focus on expressing geometric properties with equations leads to using coordinates to prove theorems algebraically. The course also examines relationships between 2- and 3-dimensional objects, including volume formulas and modeling with geometry. The fundamental goal is for students to make sense of the mathematics they learn, and for this reason all units are designed around four challenging tasks connected by lesson series. The tasks require that students find patterns, make and test conjectures, use multiple representations and approaches, make generalizations, and verify that solutions are reasonable in a given context.", "notes_prerequisites": ""}, "Technical Theater 1A": {"length": "Semester", "A-G": "F-VPA", "grades": "9-12", "description": "Theater Tech 1 provides students with a foundation of basic stagecraft skills as it applies to producing the technical aspects of theatrical production. Working with professionals from the San Francisco theatre, television and film industry, students explore design, construction, and production elements to become well-rounded theater technicians.", "notes_prerequisites": "Students may take for one semester or pair with B for yearlong "}, "AP Art History": {"length": "Yearlong", "A-G": "F-VPA", "grades": "10-12", "description": "The AP Art History course is equivalent to a two-semester college survey course exploring the nature of art, art making, and responses to art. By investigating specific course content of 250 works of art characterized by diverse artistic traditions from prehistory to the present, students develop in-depth, holistic understanding of the history of art from a global perspective. Students become active participants in the global art world, engaging with its forms and content. They experience, research, discuss, read, and write about art, artists, art making, responses to and interpretations of art.", "notes_prerequisites": ""}, "Algebra 1B / Geometry 1A (off Semester": {"length": "Yearlong", "A-G": "C-Math", "grades": "10", "description": "The CCSS Algebra 1 course is the first high school course aligned to the Common Core State Standards for Mathematics. Throughout this course, the formal understanding of functions is developed with function notation, interpreting functions in applications, and analyzing and modeling with functions. This course also focuses on interpreting the structure of expressions and writing expressions in equivalent forms. This includes performing arithmetic operations on polynomials, understanding the relationship between zeros and factors of polynomials, and solving linear equations, linear systems, and quadratic equations. This course builds heavily on modeling with mathematics by constructing and comparing linear, quadratic, and exponential models. Finally, this course looks at categorical and quantitative data on one or two variables to summarize, represent and interpret data. The fundamental goal is for all students to make sense of the mathematics they are learning, and for this reason all units are designed around four challenging tasks connected by lesson series. The tasks require that students find patterns, make and test conjectures, use multiple representations and approaches, make generalizations, and verify that solutions are reasonable in a given context.This is the second mathematics course for high school students aligned to the Common Core State Standards for mathematics. The course begins with transformations in the plane, concept of congruence through rigid motions, and similarity through dilations. Relationships established through transformational geometry are used to prove geometric theorems. Similarity leads to a study of right triangles and trigonometric ratios. A focus on expressing geometric properties with equations leads to using coordinates to prove theorems algebraically. The course also examines relationships between 2- and 3-dimensional objects, including volume formulas and modeling with geometry. The fundamental goal is for students to make sense of the mathematics they learn, and for this reason all units are designed around four challenging tasks connected by lesson series. The tasks require that students find patterns, make and test conjectures, use multiple representations and approaches, make generalizations, and verify that solutions are reasonable in a given context.", "notes_prerequisites": "For sophomores who earned a D or F in the spring semester of Algebra 1 & did not take credit recovery"}, "AP Computer Science": {"length": "Yearlong", "A-G": "C-Math", "grades": "10-12", "description": "AP Computer Science A is equivalent to a first-semester, college-level course in computer science. The course introduces students to computer science with fundamental topics that include problem solving, design strategies and methodologies, organization of data (data structures), approaches to processing data (algorithms), analysis of potential solutions, and the ethical and social implications of computing. The course emphasizes both object-oriented and imperative problem solving and design using Java language. These techniques represent proven approaches for developing solutions that can scale up from small, simple problems to large, complex problems. The AP Computer Science A course curriculum is compatible with many CS1 courses in colleges and universities.continued...", "notes_prerequisites": ""}, "Physiology": {"length": "Yearlong", "A-G": "D-Science", "grades": "12", "description": "Physiology is a science course in which students look deeper into aspects of the human body, expanding on the concepts studied in biology. Students explore the manner in which different body systems function and their interconnectedness to keep the body intact. Students explore diseases and disorders that arise when these systems do not work properly. This is a laboratory course designed to build knowledge and interest in health careers.continued...", "notes_prerequisites": "Completion of SFUSD Graduation Requirements required."}, "Scientific Research (Fruit Fly)": {"length": "Yearlong", "A-G": "D-Science", "grades": "11-12", "description": "Scientific Research is a science course covering biotechnology, HPLC, biochemistry, microbiology, cell and tissue culture, genomics, cell and molecular biology, and related technology. The objective of this course is to enable students to apply their knowledge of different topics in biological sciences while working on their research project with a mentor from the local biotechnology/pharmaceutical and academic institution. Students increase their understanding of scientific lab techniques and skills by learning course content through lectures and labs in the first semester. During the second semester, students select a project from the topics covered in the first semester and design an experiment. While conducting their research, students demonstrate their ability to solve problems and think critically by modifying their lab methods and techniques to answer their question in different fields of study.", "notes_prerequisites": "Completion of SFUSD Graduation Requirements required; Limited to 27 seats based on instructor and department chair selection from course selection list."}, "Orchestra 2 (full year)": {"length": "Yearlong", "A-G": "F-VPA", "grades": "9-12", "description": "The intermediate strings orchestra class offers students the opportunity to partake in learning, rehearsing, and performing compositions from all time eras, countries, and styles such as: classical, contemporary, opera, broadway, jazz, and modern music. Musical elements found within these pieces are practiced and explored to give students a full understanding and musical development. The instructor teaches techniques needed for the pieces. Students may perform in solo, duet, and small chamber group performances. Music theory and appreciation are covered with every new piece of music.", "notes_prerequisites": "Prior experience required"}, "Pre-Calculus Honors": {"length": "Yearlong", "A-G": "C-Math", "grades": "11-12", "description": "Students in Pre-calculus Honors deepen their understanding of expressions, equations, and functions by learning to develop patterns, make and test conjectures, and create multiple representations. The course also covers inverse functions and their constraints. Students apply their knowledge of trigonometry to the exploration of the unit circle and model periodic phenomena with trigonometric functions. They solve real-world problems involving the Laws of Sines and Cosines. Students are introduced to vectors in the complex plane and gain fluency transferring between rectangular and polar forms. They derive equations for conic sections from the definition of foci and by completing the square. Finally, students explore limits and series.", "notes_prerequisites": ""}, "Latin 1": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "9-11", "description": "Latin 1 introduces students to the study of the Latin language and the classical culture. Students learn vocabulary, grammar, syntax, and culture through stories. They study Latin words and compare them with English words derived from Latin roots. Key concepts covered are noun-adjective agreement, noun-adjective declensions, pronoun use, different verbal tenses, and some use of the infinitives. Reading, translating, listening and writing are part of students' daily practice in order to develop vocabulary and understanding of the grammar and syntax. Students learn about the Classical culture through culturally related stories that are adapted, or modified.continued...", "notes_prerequisites": ""}, "AP Physics 2": {"length": "Yearlong", "A-G": "D-Science", "grades": "11-12", "description": "The AP Physics 2 course is an algebra-based, introductory college-level physics course. Students cultivate their understanding of Physics through inquiry-based investigations as they explore topics such as fluid statics and dynamics; thermodynamics with kinetic theory; PV diagrams and probability; electrostatics; electrical circuits with capacitors; magnetic fields; electromagnetism; physical and geometric optics; and quantum, atomic, and nuclear physics.", "notes_prerequisites": "Completion of AP Physics 1 required."}, "Student Aide A (fall semester)": {"length": "Semester", "A-G": "X-Non A-G Elective", "grades": "10-12", "description": "Students are assigned to work under the supervision of a teacher, counselor, librarian or office secretary to complete non-confidential tasks as directed by the supervising staff member. Tasks may include copying materials, collating handouts, filing, setting up classroom laptops, creating hallway displays, and word processing.", "notes_prerequisites": "Students may take for one semester or pair with B for yearlong "}, "Algebra 2 CCSS": {"length": "Yearlong", "A-G": "C-Math", "grades": "10-12", "description": "This is the third course aligned to the Common Core State Standards. The course continues the previous work on functions, which includes building a function that model a relationship between two quantities and building new functions from existing functions (linear and nonlinear); constructing and comparing linear and exponential models; understanding trigonometric functions (sine and cosine), unit circle, modeling periodic phenomena, and proving and applying Pythagorean Identity; using polynomial identities, rewriting rational functions; understanding random processes, statistical experiments, and making inferences and justifying conclusions; understanding conditional probability, rules of probability, compound events, expected value, and using probability to evaluate outcomes of decisions. The fundamental goal is for all students to make sense of the mathematics they are learning, and for this reason all units are designed around four challenging tasks connected by lesson series of a varying number of days. The tasks require that students find patterns, make and test conjectures, use multiple representations and approaches, make generalizations, and verify that solutions are reasonable in a given context. The lesson series are designed to balance conceptual understanding, modeling, and procedural fluency.", "notes_prerequisites": ""}, "AP Spanish Language and Culture": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "11-12", "description": "The AP Spanish Language and Culture course emphasizes communication (understanding and being understood by others) by applying the interpersonal, interpretive, and presentational modes of communication in real-life situations. This includes vocabulary usage, language control, communication strategies, and cultural awareness. The AP Spanish Language and Culture course strives not to overemphasize grammatical accuracy at the expense of communication. To best facilitate the study of language and culture, the course is taught almost exclusively in Spanish. The AP Spanish Language and Culture course engages students in an exploration of culture in both contemporary and historical contexts. The course develops students' awareness and appreciation of cultural products (e.g., tools, books, music, laws, conventions, institutions); practices (patterns of social interactions within a culture); and perspectives (values, attitudes, and assumptions).continued...", "notes_prerequisites": "Spanish 3 and Spanish 4 or permission of Department Chair required"}, "US History": {"length": "Yearlong", "A-G": "A-History/Social Science", "grades": "11", "description": "US History introduces the major developments and turning points in American History from the 1800's to the present. The purpose is to provide students with an understanding of how the United States became a major world power and the vital contributions from a myriad of populations that enabled this growth. Students learn about the ideological origins of the nation and examine how these have transformed through major changes in history such as industrialization, The Great Depression, economic expansion, and the advent of the modern corporate economy. Utilizing a comparative framework, students examine efforts towards equal rights for minority groups, evaluate the larger cultural, political and economic contexts in which these efforts occurred(s), and analyze the economic, political, and cultural tensions that result from these efforts.", "notes_prerequisites": ""}, "Italian 2": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "9-12", "description": "Italian 2 is an intermediate language course that enables students to communicate, read, and write in Italian. Students practice Italian in simulated, realistic situations. As they learn the language structure, they perform the communicative functions of socializing, exchanging information, counting, expressing feelings and emotions, and persuading. They express themselves in past, present, and future tenses. Learners engage in critical thinking through analysis and comparisons of culture and language, and explore the target language beyond the classroom in real-world interactions within their own community. Students compare their culture to the Italian culture. They watch Italian films, create basic Italian dishes, sing Italian songs, participate in Italian heritage festivals, and report on important Italian historical figures.", "notes_prerequisites": ""}, "Leadership 1": {"length": "Yearlong", "A-G": "G-Elective", "grades": "9-12", "description": "Leadership 1 explores the characteristics of leaders and their leadership styles, and builds skills to help students realize their leadership potential. The goals of the course include the following: embed youth leadership training in meaningful projects that youth define and implement; develop youth leadership skills in communications, facilitation, teamwork; train youth as community researchers and advocates, including the use of youth-driven research to inform decision makers; prepare youth for success in real leadership positions; and initiate and plan volunteer initiatives, public art projects, community forums, and intergenerational events.continued...", "notes_prerequisites": "Permission from Activities Director required"}, "Biology, NGSS": {"length": "Yearlong", "A-G": "D-Science", "grades": "9-12", "description": "In this hands-on, lab-based NGSS Biology course, students explore biological concepts that build comprehension around two driving questions: What connections exist between Earth's changing environment and the co-evolution of life? and How and in what ways do organisms, including humans, depend on and impact the environment? Using the guidance of the CA Science Framework's High School 3-Course Model, Biology integrates both Life Science and Earth and Space Science performance expectations. Earth and Space Science concepts are integrated in a strategic way, designed to deepen student understanding of life on Earth and the interactions between the biotic and abiotic systems. Throughout the course, students build an understanding of life and how life changes over time in response to a changing environment. Central to this understanding is the study of interactions of living organisms and their environments on both macroscopic and microscopic scales.", "notes_prerequisites": ""}, "Vocal Music 2 (full year)": {"length": "Yearlong", "A-G": "F-VPA", "grades": "9-12", "description": "Vocal Music 2 is a mixed ensemble for students who demonstrate previous vocal experience or completion of Vocal Music 1. Students continue receiving instruction and practice in voice development and ensemble based singing. They further develop proper breathing, tone production, diction, sight reading, and elementary music theory. Core curriculum of this course is primarily delivered through a selected repertoire. Students sing a wide range of music, from popular to classical music. They are expected to attend all scheduled performances.", "notes_prerequisites": ""}, "AP Computer Science Principles": {"length": "Yearlong", "A-G": "G-Elective", "grades": "10-12", "description": "AP Computer Science Principles offers a multidisciplinary approach to teaching the underlying principles of computation. The course will introduce students to the creative aspects of programming, abstractions, algorithms, large data sets, the Internet, cybersecurity concerns, and computing impacts. AP Computer Science Principles also gives students the opportunity to use current technologies to create computational artifacts for both self-expression and problem solving. Together, these aspects of the course make up a rigorous and rich curriculum that aims to broaden participation in computer science.", "notes_prerequisites": ""}, "Fit for Life 2": {"length": "Yearlong", "A-G": "G-Elective", "grades": "10", "description": "Fit for Life 2 is the second course in a course sequence that develops literacy, critical thinking, oral communication, technological competency, and physical health to empower students to become health advocates for themselves and their communities. Students meditate for mental acuity and focus. They incorporate learned skills and activities into their lives to support physical and mental health.", "notes_prerequisites": ""}, "AP United States History": {"length": "Yearlong", "A-G": "A-History/Social Science", "grades": "11", "description": "AP U.S. History is designed to be the equivalent of a two-semester introductory college or university U.S. history course. In AP U.S. History students investigate significant events, individuals, developments, and processes in nine historical periods from approximately 1491 to the present. Students develop and use the same skills, practices, and methods employed by historians: analyzing primary and secondary sources; making historical comparisons; utilizing reasoning about contextualization, causation, and continuity and change over time; and developing historical arguments. The course also provides seven themes that students explore throughout the course in order to make connections among historical developments in different times and places: American and national identity; migration and settlement; politics and power; work, exchange, and technology; America in the world; geography and the environment; and culture and society.", "notes_prerequisites": ""}, "Drama 3 (full year)": {"length": "Yearlong", "A-G": "F-VPA", "grades": "10-12", "description": "Drama 3 provides students with advanced acting and stage production techniques. Students are supplied with the framework to think critically about artistic interpretation. Students engage in all production aspects culminating in a performance product. They develop not only reflective and critical thinking skills but also an appreciation and understanding of the growth process within the foundations of acting and stage production. In order to provide accurate and realistic interpretations, students analyze musical productions by researching the contexts involved.", "notes_prerequisites": ""}, "Pre-Calculus": {"length": "Yearlong", "A-G": "C-Math", "grades": "11-12", "description": "Pre-calculus is an advanced level mathematics course concentrating on advanced algebra, functions, trigonometry, analytic geometry, and discrete mathematics. This course is designed to develop students' critical thinking in the analysis of functions and function modeling. Students review and expand advanced algebra topics and apply problem solving techniques using graphical, numerical, and analytical methods. Students accurately model various scenarios using an appropriate function, and will develop their skills in choosing and justifying a model, as well as verifying results using mathematical properties and real-world contexts.", "notes_prerequisites": ""}, "Health": {"length": "Semester", "A-G": "X-Non A-G Elective", "grades": "9-12", "description": "SFUSD requires that all High School students receive a minimum of one semester of health education. The lesson breakdown is as follows: 10 lessons on mental, emotional, and social health; 21 lessons on growth and development including comprehensive sexuality curriculum; 15 lessons on alcohol, tobacco, and other drugs; 15 lessons on nutrition and physical activity; 7 lessons on safety and injury and violence prevention; and 10 lessons on other health content areas and relevant health issues based on students' needs and concerns. Projects, guest speakers, field trips, and exams supplement the course to complete the semester.continued...", "notes_prerequisites": ""}, "AP Spanish Literature and Culture": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "11-12", "description": "The AP Spanish Literature and Culture course uses a thematic approach to introduce students to representative texts (short stories, novels, poetry, and essays) from Peninsular Spanish, Latin American, and United States Hispanic literature. Students continue to develop proficiencies across the full range of the modes of communication (interpersonal, presentational, and interpretive), honing their critical reading and analytical writing skills. Literature is examined within the context of its time and place, as students reflect on the many voices and cultures present in the required readings. The course also includes a strong focus on cultural connections and comparisons, including exploration of various media (e.g., art, film, articles, and literary criticism).", "notes_prerequisites": "Spanish 3 and Spanish 4  or permission of Department Chair required"}, "AP Chinese Language and Culture": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "10-12", "description": "The AP Chinese Language and Culture course in Mandarin Chinese emphasizes communication (understanding and being understood by others) by applying interpersonal, interpretive, and presentational skills in real-life situations. This includes vocabulary usage, language control, communication strategies, and cultural awareness. The AP Chinese Language and Culture course strives not to overemphasize grammatical accuracy at the expense of communication. To best facilitate the study of language and culture, the course is taught almost exclusively in Chinese. The AP Chinese Language and Culture course engages students in an exploration of culture in both contemporary and historical contexts. The course develops students' awareness and appreciation of cultural products, (e.g., tools, books, music, laws, conventions, institutions); practices (patterns of social interactions within a culture); and perspectives (values, attitudes, and assumptions).", "notes_prerequisites": ""}, "AP Psychology": {"length": "Yearlong", "A-G": "G-Elective", "grades": "11-12", "description": "The purpose of the AP course in Psychology is to introduce the systematic and scientific study of the behavior and mental processes of human beings and other animals. Included is a consideration of the psychological facts, principles, and phenomena associated with each of the major subfields within psychology. Students also learn about the ethics and methods psychologists use in their science and practice.", "notes_prerequisites": ""}, "Peer Resources Leadership A (fall semester)": {"length": "Semester", "A-G": "G-Elective", "grades": "10-12", "description": "Peer Resources Leadership builds on the skills taught in the previous course as students develop and implement projects that increase their capabilities. Through the planning and execution of numerous events for the school, students discover how to best effect change in their communities. Students continue their study of the nature of leadership and its different styles.", "notes_prerequisites": "Students may take for one semester or pair with B for yearlong. Permission from Peer Resource teacher required"}, "Spanish 3": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "9-12", "description": "Spanish 3 is a continuation of skills from the second year, expanding on communicative functions in the three modes of communication. The class is conducted in Spanish, and students will have opportunities to exchange information, engage in conversations, and express feelings on more global topics such as the environment and travel. Learners are provided language-use activities that enable them to do the following: function in most informal and some formal settings, understand the main ideas and most supporting details in texts; produce simple narration, description and explanation; comprehend oral and written paragraphs; and produce strings of sentences. Students continue using the language to investigate and observe cultural practices and products and reflect on the perspectives that underlie them so that they will better understand, connect with, and engage with the global community in which they live. Students will use Spanish beyond the school setting and demonstrate real-life application by attending community events. They will show evidence of becoming lifelong learners by using Spanish for personal enjoyment and enrichment.continued...", "notes_prerequisites": ""}, "Chinese 3": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "9-12", "description": "Chinese 3 is a continuation of Chinese 1 and 2. It is designed for students who passed Chinese 1 and 2 level language proficiency with a basic knowledge of conversing, reading, writing in Mandarin. The course promotes the 21st century skills in critical thinking, curiosity, creativity, and responsibilities of being global citizens. Students continue to expand their listening and speaking ability that are applicable in more versatile and complex scenarios while developing reading and writing skills with more academic and complex texts. Typing in Chinese is introduced at this level.", "notes_prerequisites": ""}, "AP World History: Modern": {"length": "Yearlong", "A-G": "A-History/Social Science", "grades": "10-12", "description": "AP World History is designed to be the equivalent of a two-semester introductory college or university world history course. In AP World History students investigate significant events, individuals, developments, and processes in six historical periods from approximately 8000 B.C.E. to the present. Students develop and use the same skills, practices, and methods employed by historians: analyzing primary and secondary sources; making historical comparisons; utilizing reasoning about contextualization, causation, and continuity and change over time; and developing historical arguments. The course provides five themes that students explore throughout the course in order to make connections among historical developments in different times and places: interaction between humans and the environment; development and interaction of cultures; state building, expansion, and conflict; creation, expansion, and interaction of economic systems; and development and transformation of social structures.", "notes_prerequisites": ""}, "AP Music Theory": {"length": "Yearlong", "A-G": "F-VPA", "grades": "10-12", "description": "AP Music Theory corresponds to two semesters of a typical introductory college music theory course covering topics such as musicianship, theory, musical materials, and procedures. Students develop the ability to recognize, understand, and describe basic materials and processes of music that are heard or presented in a score. Development of aural skills is a primary objective. Students understand basic concepts and terminology by listening to and performing a wide variety of music.", "notes_prerequisites": "Applied knowledge of reading & writing music required. Teacher recommendation suggested."}, "Ceramics 1 (full year)": {"length": "Yearlong", "A-G": "F-VPA", "grades": "10-12", "description": "Ceramics 1 is a course emphasizing studio production working with the medium of clay. Students will plan their work through drawing assignments and studying the history of ceramics from around the world. Students then create works of clay art utilizing hand-building techniques such as pinch, coil, and slab to create vases, dishes, animals, tiles, coil pots, sculptures, and thrown pottery. They learn decorative techniques utilizing under-glaze, glaze, incising and sgraffito techniques. Students experience working on the potter's wheel to create their work. The course is designed to develop higher-level thinking through ceramic and technology skills, as well as being introduced to the kiln firing process. The course includes art criticism, art history and aesthetic awareness. Students will be introduced to the Elements and Principles of Art.continued...", "notes_prerequisites": ""}, "JROTC 2A": {"length": "Semester", "A-G": "X-Non A-G Elective", "grades": "10-12", "description": "The purpose of this course is to enable students to expand on skills taught in JROTC 1. This course introduces the concepts of equal opportunity, fair treatment of minorities, and prevention of sexual harassment. It provides instruction on leadership skills, leadership theories, as well as the basic principles of management. It provides self-assessments that help students determine their skill sets and opportunities to teach using accepted principles and methods of instruction. It emphasizes community service project planning and execution. It also includes dietary guidelines, fitness, and map-reading and orienteering skills.", "notes_prerequisites": "Students may take for one semester or pair with B for yearlong "}, "Drama 1 (full year)": {"length": "Yearlong", "A-G": "F-VPA", "grades": "9-12", "description": "This course is an introduction to the essential elements of drama, which include theatre terminology, voice, movement, improvisation, acting, directing, technical aspects of production, historical theatre, and theatrical careers. Students have the opportunity to develop fundamental group and self-assessment skills, problem solving skills; the ability to connect literature being studied to a variety of cultures, history, and other content areas; and the development of college and career readiness through the performing arts and 21st century skills.", "notes_prerequisites": ""}, "Geology": {"length": "Yearlong", "A-G": "D-Science", "grades": "11-12", "description": "This is an introductory course on physical geology. Topics include plate tectonics, mineralogy, petrology, geologic time, economic resources, volcanism, earthquakes and hydrology. The course emphasizes Earth as a set of interconnected systems, dynamically evolving through time. Among these are the changing thermal regimes of Earth, conservation of energy, development, and evolution of life forms and the role of changing plate arrays in geologic time. Laboratory exercises include focused studies on classification of minerals and rocks, identification of predictable patterns in nature, demonstration of chemistry in understanding how and why certain elements combine to form minerals. Beyond introducing students to the general principles of geology, there are two broad goals of the course: (1) to develop an understanding of the geologic makeup and history of California; and (2) to develop the idea of Earth as a set of interconnected systems, dynamically evolving through time.", "notes_prerequisites": "Completion of SFUSD Graduation Requirements required."}, "Spanish 4 Honors": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "9-12", "description": "In Spanish 4 Honors, students continue to increase fluency in both the written and spoken language, build their vocabulary and oral comprehension, engage in discussions that require high-level thinking skills, and synthesize information drawn from a variety of authentic sources. This advanced-intermediate course is taught in Spanish. Students draw on sources in varying mediums to write critical and persuasive essays because they possess a deeper understanding of stylistic expression. They work to improve their command of academic language thus facilitating their ability to clarify, elaborate, and support their ideas, paraphrase content, and synthesize important points in both written and spoken Spanish. Their advanced command of the spoken language allows them to provide spontaneous responses.", "notes_prerequisites": ""}, "Italian 3 Honors": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "9-12", "description": "Italian 3 Honors is a yearlong communicative course emphasizing spoken and written Italian in preparation for the AP Italian course. Students learn complex grammatical structures and idiomatic expressions and apply this knowledge to reading short stories, essays, newspaper articles, and brief novels. To advance and refine their writing skills, students write weekly reflective journal entries and short descriptive essays. Students are exposed to native speakers and culture as they view films and listen to taped radio programs and music. They participate in dialogs, conversations, discussions, and individual and group presentations to improve their speaking and listening comprehension skills.", "notes_prerequisites": ""}, "Physics, NGSS": {"length": "Yearlong", "A-G": "D-Science", "grades": "10-12", "description": "Students apply their knowledge of physical science concepts in the context of Earth and Space Science in the course NGSS Physics. Earth and space science topics of plate tectonics and cosmology are embedded into this NGSS Physics course. The story of physics progresses from observable phenomena (motion of objects, including freefall and projectile motion, and motion of larger bodies, such as continental and oceanic plates) to the force fields that govern them (electric, magnetic, and gravitational) and concludes with connecting students' year long learning to outer space and the astronomical objects in it. The course builds upon students' knowledge of mathematical concepts such as unit conversion, scientific notation, significant figure rules, dimensional analysis, and algebraic rules of calculations. It introduces students to new mathematical concepts that they use to demonstrate their understanding of physical and earth and space Science concepts.", "notes_prerequisites": "Completion of NGSS Biology and CCSS Algebra 1 required."}, "Japanese 2": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "9-12", "description": "Japanese 2 continues to build on skills introduced in Japanese 1. The course further develops basic listening, speaking, reading, and writing skills while exploring culturally relevant topics. Course content is mostly taught in the target language. Students deepen their knowledge and communication skills regarding personal and community-wide issues in the target language. Students' proficiency levels at the end of the course are expected to reach the novice mid to high range.", "notes_prerequisites": ""}, "Probability and Statistics": {"length": "Yearlong", "A-G": "C-Math", "grades": "11-12", "description": "Probability & Statistics introduce students to the major concepts and tools for collecting, analyzing, and drawing conclusions from data. This course emphasizes conceptual understanding of data analysis, with a focus on the statistical thinking that underlies data gathering and interpretation. Students learn to describe and model data distributions, describe relationships between variables, and design and apply different methods for gathering data. Students also study probability and probability models.", "notes_prerequisites": ""}, "AP Physics C: M&E and Mechanics": {"length": "Yearlong", "A-G": "D-Science", "grades": "11-12", "description": "The Physics C: Electricity and Magnetism course is a one-semester, calculus-based, college-level physics course, especially appropriate for students planning to specialize or major in physical science or engineering. The course explores topics such as electrostatics; conductors, capacitors, and dielectrics; electric circuits; magnetic fields; and electromagnetism. Introductory differential and integral calculus is used throughout the course.The Physics C: Mechanics course is equivalent to a one-semester, calculus-based, college-level physics course. It is especially appropriate for students planning to specialize or major in physical science or engineering. The course explores topics such as kinematics; Newton's laws of motion; work, energy and power; systems of particles and linear momentum; circular motion and rotation; and oscillations and gravitation. Introductory differential and integral calculus is used throughout the course.", "notes_prerequisites": "Concurrent Enrollment in Calculus + Completion of any Physics course or special permission by instructor (shapiror@sfusd.edu)."}, "Japanese 3 Honors": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "9-12", "description": "Japanese 3 Honors is designed for students to develop high-intermediate level skills in reading, writing, listening, and speaking Japanese in culturally authentic contexts. One significant aim of the course is to prepare students for the Advanced Placement Japanese Language and Culture course, which follows. Students reinforce and expand their language skills by writing in a variety of genres and interacting with materials from a variety of sources. They are expected to be able to recognize and use approximately 350 kanji by the end of the course. The course is conducted exclusively in Japanese and includes instruction in intermediate and high intermediate grammatical structures, reading comprehension, and written compositions.", "notes_prerequisites": ""}, "Journalism 1": {"length": "Yearlong", "A-G": "G-Elective", "grades": "9-12", "description": "Journalism 1 is a survey course on the basic concepts of reporting. It provides hands-on experience in the process of newspaper production. Students encounter substantial studies of the varying article formats and learn to develop their unique voice in these different writing styles. They discuss journalistic ethics and critically analyze bias in reporting. Activities involve practicing the writing, design, and editing skills to produce a newspaper; studying the legal, moral, and ethical issues surrounding media production; and observing industry professionals. It prepares students for the responsibilities of producing a newspaper and as such, there is an expectation that students contribute to each issue.", "notes_prerequisites": ""}, "Yoga 1": {"length": "Yearlong", "A-G": "X-Non A-G Elective", "grades": "10-12", "description": "This course guides students to develop yoga skills and movement patterns. Emphasis is placed on developing flexibility and strength, as well as learning safety precautions. Students are expected to improve muscle tone, flexibility, strength, and stamina. Participation in this course offers reduced stress and increased self-esteem. The additional health benefits of yoga, including improved circulation and stimulation of the immune system, are explored. Students are empowered to use the learned techniques to make wise choices, decrease stress, improve concentration and creativity, meet challenges and develop positive behaviors in individual activities, fitness, wellness, and movement activities for a lifetime.", "notes_prerequisites": ""}, "AP Physics 1 & 2 Accelerated": {"length": "Yearlong", "A-G": "D-Science", "grades": "10-12", "description": "AP Physics 1 is an algebra-based, introductory college-level physics course. Students cultivate their understanding of Physics through inquiry-based investigations as they explore topics such as Newtonian mechanics (including rotational motion); work, energy, and power; mechanical waves and sound; and introductory, simple circuits. The AP Physics 2 course is an algebra-based, introductory college-level physics course. Students cultivate their understanding of Physics through inquiry-based investigations as they explore topics such as fluid statics and dynamics; thermodynamics with kinetic theory; PV diagrams and probability; electrostatics; electrical circuits with capacitors; magnetic fields; electromagnetism; physical and geometric optics; and quantum, atomic, and nuclear physics.", "notes_prerequisites": "10th Grade Prerequisite: Permission from course instructor (e-mail dickermans@sfusd.edu);11th/12th Grade Prerequisite: Concurrent enrollment in Pre-calc Honors (11th) or AP Calc (11-12th)"}, "Ceramics 3A (fall semester)": {"length": "Semester", "A-G": "F-VPA", "grades": "12", "description": "Ceramics 3 reintroduces students to Elements of Art and the Principles of Design while expanding and refining the studio techniques necessary for self-expression in the medium of ceramics. Students continue studying handbuilding pinch pots, coil pottery, slabs, hump and slump moulds; figurative sculpture; and wheel throwing. Decorative, glazing techniques and surface design processes include mixed-media decorations, bas relief, sgraffito, incising, silk screen, pit fire, raku, low and hire fire temperatures and techniques.", "notes_prerequisites": "Students may take for one semester or pair with B for yearlong "}, "Photography 1 (full year)": {"length": "Yearlong", "A-G": "F-VPA", "grades": "9-12", "description": "Photography introduces students to the technical skills of photography that they then execute using the artistic standards and principles of design. Instruction for the first half of the course includes the history of photography, art standards, orientation to the camera as an eye, camera and accessory care, and types of cameras and formats. It provides a brief overview of image exposure and the techniques for processing, printing, and mounting photographs for exhibits. The second half of the course covers a review of the art standards and portfolio development, advanced photographic concepts, the cultural and societal significance of photography, and Internet research. It focuses on portrait, commercial product, and landscape photography. Portfolio evaluation, employability skills and resource management are emphasized to prepare students for their transition into professional work environments.", "notes_prerequisites": ""}, "AP Japanese Language and Culture": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": " 10-12", "description": "The AP Japanese Language and Culture course is designed to be comparable to college/university Japanese courses that represent the point at which students complete approximately 300 hours of college-level classroom instruction. Like the corresponding college courses, the AP Japanese Language and Culture course supports students as they develop the productive, receptive, and cultural skills necessary to communicate with native speakers of Japanese. The course prepares you to demonstrate your level of proficiency in Japanese across the three communicative modes (Interpersonal, Interpretive, and Presentational) and the five goal areas (Communication, Cultures, Connections, Comparisons, and Communities) as outlined in the Standards for Foreign Language Learning in the 21st Century. The course aims to provide you many opportunities to develop your language skills while learning about Japanese culture and society.", "notes_prerequisites": ""}, "Communications and Writing": {"length": "Yearlong", "A-G": "B-English", "grades": "9-12", "description": "In this course, students develop the skills necessary to meaningfully interact and effectively communicate in three modes: collaborative, interpretive, and productive. Through collaborative structures, students engage in textual analysis, strategy development, and extensive reading. Students participate in academic conversations, debates, formal speeches, and presentations. Students write to express their understanding and make arguments about texts. In their written and oral presentations, students are able to vary their language, style and argumentation based on their audience and identify when authors are doing the same. Ultimately, students attain the ability to independently and purposefully select texts which deepen their understanding of a particular personal, academic or career interest.", "notes_prerequisites": "Requires special placement"}, "Dance 1 (full year)": {"length": "Yearlong", "A-G": "F-VPA", "grades": "9-12", "description": "This introductory course teaches students fundamental techniques of dance: coordination, isolations, movement progressions, musicality, performance techniques, and studio etiquette. Dance forms covered include the following: contemporary modern, ballet, hip-hop, dances from the Afro-Latino/Caribbean diaspora, and other cultural dances. Class begins with a choreographed warm-up containing isolations, technical training, stretches, and strengthening movements. Students progress their dance technique and choreography, eventually working collaboratively to create their own pieces. Students learn about basic elements of anatomy and nutrition as they apply to dance training.", "notes_prerequisites": ""}, "AP Biology": {"length": "Yearlong", "A-G": "D-Science", "grades": "10-12", "description": "AP Biology is an introductory college-level biology course. Students cultivate their understanding of biology through inquiry-based investigations as they explore the following topics: evolution, cellular processes—energy and communication, genetics, information transfer, ecology, and interactions.", "notes_prerequisites": "10th Grade Prerequisite:: Concurrent enrollment in NGSS Chemistry or NGSS Chemistry Honors; and NGSS Biology teacher approval from department master list (You do not need to contact your biology teacher.)11th/12th Grade Prerequisite: Passing grade in Bio A/B & Chem A/B"}, "Architecture 1A": {"length": "Semester", "A-G": "F-VPA", "grades": "9-12", "description": "Art in Architecture 1 is a survey class designed to provide instruction in the fundamental concepts of architecture, engineering, sustainability, and aesthetics. The core curriculum emphasizes and integrates academic, practical, technical, and artistic skills. Students learn how to recognize and apply the elements and principles of design in 2D and 3D using the appropriate mechanical tools. Students study and develop models of ancient architectural structures from the bearing walls of Egypt to the arcuation of the Romans. They also explore, model and test various types of bridges to design their own original bridges that demonstrate function, structure, and beauty. They research and apply modern sustainability features in regards to energy, materials, and site. Students follow the stages of the design process in groups and individually to create scaled structural projects from beginning to end while executing architectural plans, elevations, isometric views, and models.", "notes_prerequisites": "Students may take for one semester or pair with B for yearlong "}, "Spanish 3 Honors": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "9-12", "description": "Spanish 3 Honors is a continuation of skills from the second year, expanding on communicative functions in the three modes of communication taught at a faster pace than the general education counterpart. The class is conducted in Spanish, and students will have opportunities to exchange information, engage in conversations, and express feelings on more global topics such as the environment and travel. Learners are provided language-use activities that enable them to do the following: function in most informal and some formal settings, understand the main ideas and most supporting details in texts; produce simple narration, description and explanation; comprehend oral and written paragraphs; and produce strings of sentences. Students continue using the language to investigate and observe cultural practices and products and reflect on the perspectives that underlie them so that they will better understand, connect with, and engage with the global community in which they live. Students will use Spanish beyond the school setting and demonstrate real-life application by attending community events. They will show evidence of becoming lifelong learners by using Spanish for personal enjoyment and enrichment.", "notes_prerequisites": "Permission from Spanish 2 teacher or Department Chair required"}, "AP Latin": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "10-12", "description": "The AP Latin course focuses on the in-depth study of selections from two of the greatest works in Latin literature: Vergil's Aeneid and Caesar's Gallic War. The course requires students to prepare and translate the readings and place these texts in a meaningful context, which helps develop critical, historical, and literary sensitivities. Throughout the course, students consider themes in the context of ancient literature and bring these works to life through classroom discussions, debates, and presentations. Additional English readings from both of these works help place the Latin readings in a significant context.", "notes_prerequisites": ""}, "Soccer (full semester)": {"length": "Semester", "A-G": "X-Non A-G Elective", "grades": "10-12", "description": "This course teaches students the fundamental and advanced skills of soccer, as well as fitness concepts and conditioning techniques used for achieving and maintaining optimal physical fitness. Students benefit from comprehensive team activities and cardio respiratory exercises. The class includes both lecture and activity sessions. Students are empowered to make wise choices, meet challenges, and develop positive behaviors in team activities, aerobic fitness, wellness, and movement activity for a lifetime.", "notes_prerequisites": ""}, "Algebra 2B  (off semester)": {"length": "Semester", "A-G": "C-Math", "grades": "11-12", "description": "This is the third course aligned to the Common Core State Standards. The course continues the previous work on functions, which includes building a function that model a relationship between two quantities and building new functions from existing functions (linear and nonlinear); constructing and comparing linear and exponential models; understanding trigonometric functions (sine and cosine), unit circle, modeling periodic phenomena, and proving and applying Pythagorean Identity; using polynomial identities, rewriting rational functions; understanding random processes, statistical experiments, and making inferences and justifying conclusions; understanding conditional probability, rules of probability, compound events, expected value, and using probability to evaluate outcomes of decisions. The fundamental goal is for all students to make sense of the mathematics they are learning, and for this reason all units are designed around four challenging tasks connected by lesson series of a varying number of days. The tasks require that students find patterns, make and test conjectures, use multiple representations and approaches, make generalizations, and verify that solutions are reasonable in a given context. The lesson series are designed to balance conceptual understanding, modeling, and procedural fluency.continued...", "notes_prerequisites": "For juniors or seniors who earned a D or F in the spring semester of Algebra 2 & did not take credit recovery"}, "Symphonic Band (full year)": {"length": "Yearlong", "A-G": "F-VPA", "grades": "9-12", "description": "This course explores a variety of styles and genres through the rehearsal and performance of symphonic band literature. Students gain an appreciation of music as an art form and develop the skills necessary to pursue a variety of careers in professional music. This course includes music theory and performance as well as the study of historical and contemporary music.", "notes_prerequisites": "Audition required"}, "Vocal Music 1 (full year)": {"length": "Yearlong", "A-G": "F-VPA", "grades": "9-12", "description": "Vocal Music 1 is an introductory course designed to develop students' skills in the choral setting. Students receive beginning instruction and practice in voice development and ensemble-based singing. They learn proper breathing, tone production, diction, sight reading, and elementary music theory. Vocal exploration takes place on a solo, small group, and large group performance level, as well as lecture and extensive listening. Students will be expected to attend all scheduled performances.continued...", "notes_prerequisites": ""}, "Journalism 2": {"length": "Yearlong", "A-G": "G-Elective", "grades": "10-12", "description": "Journalism 2 develops students' advanced skills in media studies with an emphasis on magazine and newspaper writing formats. The types of writing styles include news writing, in-depth feature writing, interviews/profiles, book reviews, movie reviews, restaurant reviews, product reviews, sports writing, and editorials. Students examine the role of media within various types of government, and in particular, the relationship between democracy and the media. They become familiar with journalism's code of ethics and standards, eventually identifying these aspects in their own writing. The class introduces standard publishing software, including Adobe In-Design, Photoshop, Print Shop, Microsoft Publisher and Word.", "notes_prerequisites": ""}, "AVID 2": {"length": "Yearlong", "A-G": "G-Elective", "grades": "10", "description": "The AVID course is an elective class for students who are college-bound. The AVID curriculum focuses on writing, inquiry, collaboration and reading (WICR) through the AVID High School curriculum in both teacher and tutor-led activities. While concurrently enrolled in a college-prep course of study, students learn strategies to enhance success. Note-taking, outlining, writing, speaking, reading, test-taking strategies, and self-awareness are stressed. In addition, the course includes college motivational activities and intensive preparation for ACT, SAT I and SAT II.", "notes_prerequisites": "AVID 1 or approval from the AVID coordinator required"}, "Spanish 1": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "9-11", "description": "Spanish 1 is a first-year language course for beginning, non-native speaking students. The course develops basic listening, speaking, reading and writing skills in Spanish while exploring the diverse Spanish-speaking world. Students learn vocabulary for everyday needs and activities as well as grammatical forms and functions. Spanish is used as much as possible as the method of instruction. Through a variety of interactive activities, learners engage in interpersonal, interpretive, and presentational modes of communication using the target language. In addition learners engage in critical thinking through analysis and comparisons of culture and language, and explore the target language beyond the classroom in real-world interactions within their own community.", "notes_prerequisites": "No prior knowledge in Spanish necessary"}, "AP English Literature and Composition": {"length": "Yearlong", "A-G": "B-English", "grades": "12", "description": "The AP English Literature and Composition course will engage you in the careful reading and critical analysis of imaginative literature. Through the close reading of selected texts, you can deepen your understanding of the ways writers use language to create meaning. You'll learn to consider a work's structure, style, and themes, as well as smaller-scale elements such as the use of figurative language, imagery, symbolism, and tone.continued...", "notes_prerequisites": "Seniors will have an opportunity (space permitting) to choose from one of the theme pairings below in Arena: + Heroes, Tragic and Comic / Masterworks in English+ The Individual in the Universe / Portraits of the Artist"}, "Ceramics 2 (full year)": {"length": "Yearlong", "A-G": "F-VPA", "grades": "11-12", "description": "Ceramics 2 builds upon the foundation established and developed in Ceramics 1 and allows students to explore in depth special interest areas of wheel throwing and hand-building. Students continue to study and use the Elements of Art and the Principles of Design while emphasizing conceptual art making, craftsmanship, creativity, and personal expression. Over the duration of this course, students create a series of projects that guide them through the exploration of their own personal identity. Each project is about the various aspects of their life experiences: identifying themselves, how they fit within their family unit, their culture, and eventually society. Students look at a variety of contemporary artists as models of how to address the concepts explored in each unit. Materials used include clay, glaze, underglaze, overglaze, ceramic stains and oxides.", "notes_prerequisites": ""}, "World History": {"length": "Yearlong", "A-G": "A-History/Social Science", "grades": "9-10", "description": "World History examines eight core concepts: identity, community, culture, citizenship, migration, resources, system, and power to drive student inquiry and learning. The course covers a period of more than 250 years, highlighting the intensification of global history as people, products, diseases, knowledge, and ideas spread around the world. The course begins with a turning point: the important transition in European systems of governance from divine monarchy to a modern definition of a nation-state organized around principles of the Enlightenment. The course ends with the present day, providing ample opportunities for teachers to make connections to the globalized world in which students live.", "notes_prerequisites": ""}, "Italian 1": {"length": "Yearlong", "A-G": "E-Language other than English", "grades": "9-11", "description": "Italian 1 is a beginning language course that enables students to communicate, read, and write in Italian. Students practice Italian in simulated, realistic situations. As they learn the language structure, they perform the communicative functions of socializing, exchanging information, counting, expressing feelings and emotions, and persuading. Learners engage in critical thinking through analysis and comparisons of culture and language, and explore the target language beyond the classroom in real-world interactions within their own community. Students compare their culture to the Italian culture. They watch Italian films, create basic Italian dishes, sing Italian songs, participate in Italian heritage festivals, and report on important Italian historical figures.", "notes_prerequisites": ""}, "Dance 3 (full year)": {"length": "Yearlong", "A-G": "F-VPA", "grades": "10-12", "description": "Dance 3 is for students who wish to excel in the art of dance through exposure to advanced techniques. Students have opportunities to perform student and professional choreographed works in front of an audience. Genres covered include contemporary, ballet, jazz, tap, and cultural/traditional dance forms. While learning these various techniques, students develop an advanced level of vocabulary and movement to help them define their steps at a professional pace and level in both improvisational work and choreography.", "notes_prerequisites": ""}}